Reports/ОтчетПоЧастотеПотерь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ОтчетПоЧастотеПотерь</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МаксЧастота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВсехПроизводителей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчитатьПоТенденции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/ОтчетПоЧастотеПотерь/Forms/ФормаОтчета/Ext/Form/Module.bsl
Процедура УстановитьНадписьНомерНеделиНач()
	
	мНомерНедели = ДопМодульСервер.ПолучитьНомерНеделиПоДате(Отчет.ДатаНачала);
	Элементы.НадписьНомерНеделиНач.Заголовок = ?(НЕ мНомерНедели = 0, "(" + Формат(мНомерНедели, "ЧГ=") + ")", "");
	
КонецПроцедуры

Процедура УстановитьНадписьНомерНеделиКон()
	
	мНомерНедели = ДопМодульСервер.ПолучитьНомерНеделиПоДате(Отчет.ДатаОкончания);
	Элементы.НадписьНомерНеделиКон.Заголовок = ?(НЕ мНомерНедели = 0, "(" + Формат(мНомерНедели, "ЧГ=") + ")", "");
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.МаксЧастота = 0.85;
	
	Отчет.ДатаОкончания = КонецНедели(ТекущаяДата());
	Отчет.ДатаНачала 	= НачалоНедели(Отчет.ДатаОкончания) - 9*7*86400;
	УстановитьНадписьНомерНеделиНач();
	УстановитьНадписьНомерНеделиКон();
	
	Отчет.ВыводитьВсехПроизводителей 	= Истина;
	Отчет.СчитатьПоТенденции 			= Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура РедактироватьПериод(Команда)
	
	СтандартныйПериод = Новый СтандартныйПериод(Отчет.ДатаНачала, Отчет.ДатаОкончания);
	ДиалогРедактирования = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогРедактирования.Период = СтандартныйПериод;
	Если ДиалогРедактирования.Редактировать() Тогда
		СтандартныйПериод = ДиалогРедактирования.Период;
		Отчет.ДатаНачала 		= СтандартныйПериод.ДатаНачала;
		Отчет.ДатаОкончания 	= СтандартныйПериод.ДатаОкончания;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Отчет.ДатаНачала)
			И ЗначениеЗаполнено(Отчет.ДатаОкончания) Тогда
		
		Если НЕ Отчет.ДатаНачала = НачалоНедели(Отчет.ДатаНачала) Тогда
			Отчет.ДатаНачала = НачалоНедели(Отчет.ДатаНачала);
		КонецЕсли;
		Если НЕ Отчет.ДатаОкончания = НачалоДня(КонецНедели(Отчет.ДатаОкончания)) Тогда
			Отчет.ДатаОкончания = КонецНедели(Отчет.ДатаОкончания);
		КонецЕсли;
		//Если ЗначениеЗаполнено(Отчет.ДатаОкончания)
		//		И Отчет.ДатаНачала > НачалоНедели(Отчет.ДатаОкончания) Тогда
		//	Отчет.ДатаНачала = НачалоНедели(Отчет.ДатаОкончания);
		//ИначеЕсли ЗначениеЗаполнено(Отчет.ДатаНачала)
		//		И Отчет.ДатаОкончания < НачалоДня(КонецНедели(Отчет.ДатаНачала)) Тогда
		//	Отчет.ДатаОкончания = КонецНедели(Отчет.ДатаНачала);
		//КонецЕсли;
		Если НЕ Отчет.ДатаНачала = Отчет.ДатаОкончания - (10*7-1)*86400 Тогда
			Отчет.ДатаНачала = Отчет.ДатаОкончания - (10*7-1)*86400
		КонецЕсли;
		
		УстановитьНадписьНомерНеделиНач();
		УстановитьНадписьНомерНеделиКон();
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(Отчет.ДатаНачала) Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Должна быть указана дата начала периода!";
			СообщениеПользователю.Сообщить();
		КонецЕсли;
	
		Если НЕ ЗначениеЗаполнено(Отчет.ДатаОкончания) Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Должна быть указана дата окончания периода!";
			СообщениеПользователю.Сообщить();
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	Если НЕ Отчет.ДатаНачала = НачалоНедели(Отчет.ДатаНачала) Тогда
		Отчет.ДатаНачала = НачалоНедели(Отчет.ДатаНачала);
	КонецЕсли;
	
	УстановитьНадписьНомерНеделиНач();
	
	Если НЕ Отчет.ДатаОкончания = Отчет.ДатаНачала + (10*7-1)*86400 Тогда
		Отчет.ДатаОкончания = Отчет.ДатаНачала + (10*7-1)*86400;
		УстановитьНадписьНомерНеделиКон();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	Если НЕ Отчет.ДатаОкончания = КонецНедели(Отчет.ДатаОкончания) Тогда
		Отчет.ДатаОкончания = КонецНедели(Отчет.ДатаОкончания);
	КонецЕсли;
	
	УстановитьНадписьНомерНеделиКон();
	
	Если НЕ Отчет.ДатаНачала = Отчет.ДатаОкончания - (10*7-1)*86400 Тогда
		Отчет.ДатаНачала = Отчет.ДатаОкончания - (10*7-1)*86400;
		УстановитьНадписьНомерНеделиНач();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МаксЧастотаПриИзменении(Элемент)
	
	Если Отчет.МаксЧастота > 1 Тогда
		Отчет.МаксЧастота = 1;
	КонецЕсли;
	
КонецПроцедуры
